abusaidm.html-snippets
Angular.ng-template
arcticicestudio.nord-visual-studio-code
eamodio.gitlens
ecmel.vscode-html-css
EditorConfig.EditorConfig
eg2.vscode-npm-script
fabiospampinato.vscode-todo-plus
formulahendry.code-runner
James-Yu.latex-workshop
johnpapa.Angular2
ms-python.python
ms-vscode.cpptools
ms-vscode.vscode-typescript-tslint-plugin
msjsdiag.debugger-for-chrome
PKief.material-icon-theme
rarnoldmobile.todo-txt
redhat.vscode-yaml
ryanolsonx.solarized
VisualStudioExptTeam.vscodeintellicode
vscode-icons-team.vscode-icons
yzhang.markdown-all-in-one
