abusaidm.html-snippets
Angular.ng-template
arcticicestudio.nord-visual-studio-code
eamodio.gitlens
ecmel.vscode-html-css
EditorConfig.EditorConfig
eg2.vscode-npm-script
fabiospampinato.vscode-todo-plus
formulahendry.code-runner
James-Yu.latex-workshop
johnpapa.Angular2
mads-hartmann.bash-ide-vscode
ms-python.python
ms-vscode.cpptools
ms-vscode.vscode-typescript-tslint-plugin
msjsdiag.debugger-for-chrome
Pivotal.vscode-boot-dev-pack
Pivotal.vscode-concourse
Pivotal.vscode-manifest-yaml
Pivotal.vscode-spring-boot
PKief.material-icon-theme
rarnoldmobile.todo-txt
redhat.java
redhat.vscode-yaml
ryanolsonx.solarized
truman.autocomplate-shell
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vscode-icons-team.vscode-icons
yzhang.markdown-all-in-one
