tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Bash and Zsh completion for Gradle
brew "gradle-completion"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Platform built on V8 to build network applications
brew "node"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Password manager that keeps all passwords secure behind one password
cask "1password"
cask "adoptopenjdk"
# Android SDK component
cask "android-platform-tools"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
# Web browser
cask "firefox"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
# Version of Cascadia Code with embedded Powerline symbols
cask "font-cascadia-code-pl"
# Version of Cascadia Code without ligatures
cask "font-cascadia-mono"
# Version of Cascadia Code without ligatures and with embedded Powerline symbols
cask "font-cascadia-mono-pl"
cask "font-fira-code"
cask "garagesale"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# Free and open-source media player
cask "iina"
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Media player based on MPlayer and mplayer2
cask "mpv"
# VPN client
cask "mullvadvpn"
# Music streaming service
cask "spotify"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
